#**Trabalhando com Planilhas do Excel**

In [2]:
#Importando a biblioteca
import pandas as pd

In [3]:
#Leitura dos arquivos
df1 = pd.read_excel("../datasets/Aracaju.xlsx")
df2 = pd.read_excel("../datasets/Fortaleza.xlsx")
df3 = pd.read_excel("../datasets/Natal.xlsx")
df4 = pd.read_excel("../datasets/Recife.xlsx")
df5 = pd.read_excel("../datasets/Salvador.xlsx")

In [5]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [6]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [6]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [7]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [8]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
143      Natal 2019-01-02   41.18    1037     2
58       Natal 2018-12-23  272.00     853     3
125     Recife 2019-03-02   37.60     983     4
59   Fortaleza 2019-01-01    6.31    1002     3
78    Salvador 2019-01-01  111.20    1036     3

In [9]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [10]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [11]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [12]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [57]:
#Consultando linhas com valores faltantes, contando quantos valores nulos existem no dataset
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [8]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [15]:
df["Vendas"].mean()

122.98078651685393

In [9]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [29]:
df.loc[df["Vendas"].round(2) == 122.98].round(2)

    Cidade       Data  Vendas  LojaID  Qtde
213  Natal 2019-01-02  122.98    1035     1
217  Natal 2019-01-02  122.98    1036     2
222  Natal 2019-01-02  122.98    1037     1
226  Natal 2019-01-02  122.98    1035     2

In [18]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [19]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [20]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [21]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [59]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [60]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00    1520     1   142.00
1  Aracaju 2018-01-01   14.21    1522     6    85.26
2  Aracaju 2018-01-01   71.55    1520     1    71.55
3  Aracaju 2018-01-01    3.01    1521     7    21.07
4  Aracaju 2018-01-01   24.51    1522     8   196.08

In [61]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [62]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00    1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21    1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55    1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01    1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51    1522     8   196.08             8.0

In [63]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [27]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [64]:
#nlargest metodo usado para mostrar o top 3 das maiores receitas
df.nlargest(3, "Receita")

   Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0     853     4   3544.0             4.0
51  Natal 2018-01-21   859.0     852     4   3436.0             4.0
55  Natal 2019-01-08   859.0     854     4   3436.0             4.0

In [65]:
#nsamllest metodo usado para mostrar o top 3 das menores receitas
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34    1522     1     3.34             1.0
65    Recife 2019-01-01    4.01     981     1     4.01             1.0
92     Natal 2019-01-02    4.57    1035     1     4.57             1.0

In [66]:
#Agrupamento por cidade para mostrar a soma de todas as receitas por cidade.
df.groupby("Cidade")["Receita"].sum().round(2)

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167727.38
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [31]:
#Ordenando o conjunto de dados a coluna receita por ordem do maior para o menor.
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [86]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [87]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID              int64
Qtde                int64
Receita           float64
Receita/Vendas    float64
mes_venda           int64
dia_venda           int64
dtype: object

In [88]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [89]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                     int64
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
mes_venda                  int64
dia_venda                  int64
dtype: object

In [36]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.530000
2019    228746.314719
Name: Receita, dtype: float64

In [92]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [93]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,mes_venda,dia_venda,Ano_Venda
68,Natal,2018-06-22,274.000000,852,3,822.000000,3.0,6,22,2018
93,Recife,2019-01-01,17.450000,980,6,104.700000,6.0,1,1,2019
219,Natal,2019-01-02,19.670000,1037,2,39.340000,2.0,1,2,2019
229,Salvador,2019-01-02,43.080000,1036,2,86.160000,2.0,1,2,2019
226,Natal,2019-01-02,122.980787,1035,2,245.961573,2.0,1,2,2019

In [94]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [95]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,mes_venda,dia_venda,Ano_Venda
8,Fortaleza,2019-02-11,37.49,1005,1,37.49,1.0,2,11,2019
130,Natal,2019-01-02,59.78,1036,1,59.78,1.0,1,2,2019
63,Recife,2019-01-01,37.95,980,2,75.90,2.0,1,1,2019
81,Recife,2019-01-01,36.52,982,8,292.16,8.0,1,1,2019
138,Fortaleza,2019-03-02,150.38,983,6,902.28,6.0,3,2,2019

In [96]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [97]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [98]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,mes_venda,dia_venda,Ano_Venda,diferenca_dias
89,Recife,2019-01-01,18.11,980,3,54.33,3.0,1,1,2019,365 days
73,Natal,2018-01-05,773.00,852,2,1546.00,2.0,1,5,2018,4 days
4,Natal,2019-03-09,699.00,853,3,2097.00,3.0,3,9,2019,432 days
87,Salvador,2019-01-01,135.19,1034,2,270.38,2.0,1,1,2019,365 days
202,Salvador,2019-01-02,22.45,1036,1,22.45,1.0,1,2,2019,366 days

In [99]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [100]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,mes_venda,dia_venda,Ano_Venda,diferenca_dias,trimestre_venda
35,Aracaju,2018-01-01,40.60,1520,3,121.80,3.0,1,1,2018,0 days,1
140,Fortaleza,2019-03-02,166.89,983,5,834.45,5.0,3,2,2019,425 days,1
80,Fortaleza,2019-01-01,47.88,1003,2,95.76,2.0,1,1,2019,365 days,1
71,Fortaleza,2019-01-01,41.89,1004,4,167.56,4.0,1,1,2019,365 days,1
176,Salvador,2019-01-02,19.42,1035,3,58.26,3.0,1,2,2019,366 days,1

In [101]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [103]:
vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,mes_venda,dia_venda,Ano_Venda,diferenca_dias,trimestre_venda
128,Salvador,2019-03-02,36.84,1034,1,36.84,1.0,3,2,2019,425 days,1
133,Fortaleza,2019-03-02,14.67,980,7,102.69,7.0,3,2,2019,425 days,1
120,Recife,2019-03-02,184.90,982,4,739.60,4.0,3,2,2019,425 days,1
115,Recife,2019-03-02,12.23,981,3,36.69,3.0,3,2,2019,425 days,1
139,Salvador,2019-03-02,169.01,1036,1,169.01,1.0,3,2,2019,425 days,1
139,Recife,2019-03-02,141.16,980,7,988.12,7.0,3,2,2019,425 days,1
126,Fortaleza,2019-03-02,41.87,980,8,334.96,8.0,3,2,2019,425 days,1
123,Recife,2019-03-02,20.22,981,6,121.32,6.0,3,2,2019,425 days,1
110,Fortaleza,2019-03-02,51.98,983,6,311.88,6.0,3,2,2019,425 days,1
135,Fortaleza,2019-03-02,10.79,983,5,53.95,5.0,3,2,2019,425 days,1
138,Recife,2019-03-02,150.38,983,6,902.28,6.0,3,2,2019,425 days,1
136,Recife,2019-03-02,39.09,982,4,156.36,4.0,3,2,2019,425 days,1
120,Fortaleza,2019-03-02,184.90,982,4,739.60,4.0,3,2,2019,425 days,1
32,Natal,2019-03-17,244.00,854,2,488.00,2.0,3,17,2019,440 days,1
18,Natal,2019-03-14,581.00,853,3,1743.00,3.0,3,14,2019,437 days,1
119,Salvador,2019-03-02,136.37,1034,2,272.74,2.0,3,2,2019,425 days,1
4,Natal,2019-03-09,699.00,853,3,2097.00,3.0,3,9,2019,432 days,1
69,Natal,2019-03-24,817.00,852,4,3268.00,4.0,3,24,2019,447 days,1
123,Salvador,2019-03-02,127.45,1036,3,382.35,3.0,3,2,2019,425 days,1
74,Natal,2019-03-10,303.00,854,3,909.00,3.0,3,10,2019,433 days,1